Documents/ЗачислениеВДетскийСад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ЗачислениеВДетскийСад</Name>
			<Comment>Зачисление в детский сад</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗачисленияИВыпуск</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Comment>Группа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Группы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗачисления</Name>
					<Comment>Дата зачисления</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Воспитанник</Name>
					<Comment>Воспитанник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Дети</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ_Дети</Name>
					<Comment>Дети</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ребенок</Name>
							<Comment>Ребенок</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Дети</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗачисления</Name>
							<Comment>Дата зачисления</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРождения</Name>
							<Comment>Дата рождения</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗачислениеВДетскийСад/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ЗачислениеВДетскийСад.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗачислениеВДетскийСад.Воспитанник,
	|	ЗачислениеВДетскийСад.Группа,
	|	ЗачислениеВДетскийСад.Дата,
	|	ЗачислениеВДетскийСад.ДатаЗачисления,
	|	ЗачислениеВДетскийСад.Номер,
	|	ЗачислениеВДетскийСад.ТЧ_Дети.(
	|		НомерСтроки,
	|		Ребенок,
	|		Ребенок.Ссылка КАК Ребенок,	
	|		ДатаЗачисления,
	|		ДатаРождения
	|	)
	|ИЗ
	|	Документ.ЗачислениеВДетскийСад КАК ЗачислениеВДетскийСад
	|ГДЕ
	|	ЗачислениеВДетскийСад.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТЧ_ДетиШапка = Макет.ПолучитьОбласть("ТЧ_ДетиШапка");
	ОбластьТЧ_Дети = Макет.ПолучитьОбласть("ТЧ_Дети");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТЧ_ДетиШапка);
		ВыборкаТЧ_Дети = Выборка.ТЧ_Дети.Выбрать();
		Пока ВыборкаТЧ_Дети.Следующий() Цикл
			ОбластьТЧ_Дети.Параметры.Заполнить(ВыборкаТЧ_Дети);
			ТабДок.Вывести(ОбластьТЧ_Дети, ВыборкаТЧ_Дети.Уровень());
		КонецЦикла; 
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
